### Content
- wrangling order and department data
- change name of variable
- finding frequency of variable order_hour_of_day
- Determine the meaning behind a value of 4 in the "department_id" column
- creating subset of breakfast item sales
- information about dinner parties
- row count of party_prods
- user info/ basic stats about user with user_id = 1
- export new wrangled df (orders and department)

In [1]:
# importing lybaries

import pandas as pd
import numpy as np
import os

In [2]:
# importing data

path = r'/Users/lennartzeidler/Desktop/Uni/Instacart Basket Analysis 08.10.2022 (4)'

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'))
df_departs = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'))
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'))
df_customs = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [3]:
df_customs.shape

(206209, 10)

In [3]:
# wrangling data

df_ords = df_ords.drop(columns = ['eval_set']) # drop eval_set column
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True) # rename order_dow column
df_ords['order_id'] = df_ords['order_id'].astype('str') # changing data type of column order_id

df_prods['department_id'] = df_prods['department_id'].astype('str') # changing data type for later steps

df_customs['user_id'] = df_customs['user_id'].astype('str') # changing data type for later steps

### step 2 ==> droping one more column

looking for another variable that doesn't need to be an integer using >> df_ords.head()  
    ==> user_id or order_number

In [4]:
df_ords['user_id'] = df_ords['user_id'].astype('str') # checked if worked with >> df_ords['user_id'].dtype

### step 3 ==> change name of variable

looking for another variable wich name could be changed using >> df_ords.head()  
I think I already changed the one that was meant by the task in the wrangling step.  
Whatever I am not happy with the name givven by the article because it's not the same patern as the order_hour_of_day variable.

In [5]:
df_ords.rename(columns = {'orders_day_of_week' : 'order_day_of_week'}, inplace = True)

In [6]:
df_ords.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

### step 4 ==> finding frequency of variable order_hour_of_day

In [7]:
df_ords['order_hour_of_day'].value_counts() # ==> 288418 orders at 10am(10 o'clock)

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

### step 5 ==> 
Determine the meaning behind a value of 4 in the "department_id" column

In [8]:
df_departs = df_departs.T # swapping rows with columns
df_departs.reset_index() # reset index
newheader = df_departs.iloc[0] # copying first row into variable
df_departs = df_departs[1:] # copying everything from second row(index of 1)
df_departs.columns = newheader # asining new headers
data_dict = df_departs.to_dict('index') # create data dictonary

In [9]:
data_dict # produce is the depatement with the departement_id of 4

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

### step 6 ==> creating subset of breakfast item sales  
==> breakfast index = 14

In [16]:
df_breakfast = df_prods[df_prods['department_id'] == '14']
df_breakfast = df_breakfast.drop(columns = ['department_id'])

In [18]:
df_breakfast.head()

,product_id,product_name,aisle_id,prices
27,28,Wheat Chex Cereal,121,10.1
33,34,NaN,121,12.2
67,68,"Pancake Mix, Buttermilk",130,13.7
89,90,Smorz Cereal,121,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,3.6

### step 7 ==> information about dinner parties

In [12]:
# getting department_id
departments = ['alcohol', 'deli', 'beverages', 'meat seafood']
diner_party_departments = df_departs.loc[df_departs['department'].isin(departments)]
 
depindexs = diner_party_departments.department.index.tolist() # get indexs of departments

party_prods = df_prods.loc[df_prods['department_id'].isin(depindexs)]
party_prods = party_prods.drop(columns = ['department_id'])

party_prods # Products to match a dinner party

,product_id,product_name,aisle_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,4.5
6,7,Pure Coconut Water With Orange,98,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,8.4
10,11,Peach Mango Juice,31,2.8
16,17,Rendered Duck Fat,35,17.1
...,...,...,...,...
49676,49672,Cafe Mocha K-Cup Packs,26,6.5
49679,49675,Cinnamon Dolce Keurig Brewed K Cups,26,14.0
49680,49676,Ultra Red Energy Drink,64,14.5
49686,49682,California Limeade,98,4.3
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5.3

To gain more information about the orders and customers I would need the order_products__SET dataset. Currently I dont have acces to this dataset.

### step 8 ==> row count of party_prods

In [13]:
party_prods.shape # this df containes 7650 rows

(7650, 4)

### step 9 ==> user info

In [26]:
df_customs[df_customs['user_id'] == '1']

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
134862,1,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [27]:
df_ords[df_ords['user_id'] == '1'] # I can't find something weird

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

### step 10 ==> basic stats about user with user_id = 1

In [30]:
df_ords[df_ords['user_id'] == '1'].describe()

,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,11.000000,11.000000,11.000000,10.000000
mean,6.000000,2.636364,10.090909,19.000000
std,3.316625,1.286291,3.477198,9.030811
min,1.000000,1.000000,7.000000,0.000000
25%,3.500000,1.500000,7.500000,14.250000
50%,6.000000,3.000000,8.000000,19.500000
75%,8.500000,4.000000,13.000000,26.250000
max,11.000000,4.000000,16.000000,30.000000

### step 11 ==> export df_ords

In [31]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

### step 12 ==> export df_departs

In [ ]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled.csv'))